In [83]:
import pandas as pd

In [84]:
PIB= pd.read_csv(r'Pib.csv')

In [85]:
PIB.drop(['Indicator Name', 'Indicator Code', 'Unnamed: 66'], axis=1, inplace= True)

In [86]:
PIB.drop(columns=PIB.columns[2:32],axis=1,inplace= True)

In [87]:
PIB.drop([1,3], axis=0, inplace=True)

In [88]:
PIB.fillna(0, inplace= True)

In [89]:
PIB.rename(columns={'Country Name':'pais','Country Code':'codigo_pais'}, inplace=True)

In [90]:
pib = PIB.melt(id_vars=['pais','codigo_pais'], var_name='anio', value_name='PIB')

In [91]:
pib['anio'] = pib['anio'].astype('int64')

In [92]:
pib.head()

         pais codigo_pais  anio        PIB
0       Aruba         ABW  1990   2.195805
1  Afganistán         AFG  1990   0.000000
2      Angola         AGO  1990  -6.626409
3     Albania         ALB  1990 -11.187905
4     Andorra         AND  1990   0.042321

In [93]:
df_salario_minimo = pd.read_csv(r'Datsets\salario_minimo_mensual_bruto_anual_dolares.csv',sep=',', header=0)

In [94]:
df_salario_minimo.drop('source', axis=1, inplace=True)
df_salario_minimo.drop('source.label', axis=1, inplace=True)
df_salario_minimo.drop('indicator', axis=1, inplace=True)
df_salario_minimo.drop('indicator.label', axis=1, inplace=True)
df_salario_minimo.drop('classif1', axis=1, inplace=True)
df_salario_minimo.drop('classif1.label', axis=1, inplace=True)
df_salario_minimo.drop('obs_status', axis=1, inplace=True)
df_salario_minimo.drop('obs_status.label', axis=1, inplace=True)
df_salario_minimo.drop('note_indicator', axis=1, inplace=True)
df_salario_minimo.drop('note_indicator.label', axis=1, inplace=True)
df_salario_minimo.drop('note_source', axis=1, inplace=True)
df_salario_minimo.drop('note_source.label', axis=1, inplace=True)

In [95]:
df_salario_minimo.rename(columns={'ref_area':'codigo_pais', 'ref_area.label':'pais', 'time':'anio', 'obs_value':'salario_minimo'}, inplace=True)

In [96]:
df_salario_minimo = df_salario_minimo[(df_salario_minimo['anio'] >= 1990)]

In [97]:
df_average_wages = pd.read_csv(r'Datsets\average_wages.csv', sep=',', header=0)

In [98]:
df_average_wages.drop('INDICATOR', axis=1, inplace=True)
df_average_wages.drop('SUBJECT', axis=1, inplace=True)
df_average_wages.drop('MEASURE', axis=1, inplace=True)
df_average_wages.drop('FREQUENCY', axis=1, inplace=True)
df_average_wages.drop('Flag Codes', axis=1, inplace=True)

In [99]:
df_average_wages.rename(columns={'LOCATION':'codigo_pais', 'TIME':'anio', 'Value':'salario_promedio'}, inplace=True)

In [100]:
df_average_wages.head()

  codigo_pais  anio  salario_promedio
0         AUS  1990      40519.083621
1         AUS  1991      40328.934866
2         AUS  1992      41135.798085
3         AUS  1993      41513.545516
4         AUS  1994      41789.766398

In [101]:
df_wage_levels = pd.read_csv(r'Datsets\wage_levels.csv', sep=',', header=0)

In [102]:
df_wage_levels.drop('INDICATOR', axis=1, inplace=True)
df_wage_levels.drop('MEASURE', axis=1, inplace=True)
df_wage_levels.drop('FREQUENCY', axis=1, inplace=True)
df_wage_levels.drop('Flag Codes', axis=1, inplace=True)

In [103]:
df_wage_levels = df_wage_levels[(df_wage_levels['TIME'] >= 1990)]

In [104]:
df_wage_levels_low = df_wage_levels[df_wage_levels['SUBJECT'] == 'LPAY'].rename(columns={'Value':'low_pay'}).drop(['SUBJECT'], axis=1)

In [105]:
df_wage_levels_high = df_wage_levels[df_wage_levels['SUBJECT'] == 'HPAY'].rename(columns={'Value':'high_pay'}).drop(['SUBJECT'], axis=1)

In [106]:
df_wage_levels_merged = pd.merge(df_wage_levels_high, df_wage_levels_low, on=['LOCATION','TIME'], how='outer')

In [107]:
df_wage_levels_merged.rename(columns={'LOCATION':'codigo_pais', 'SUBJECT':'tipo', 'TIME': 'anio'}, inplace=True)

In [108]:
df_wage_levels_merged.head()

  codigo_pais  anio   high_pay    low_pay
0         AUT  2004  19.678054  15.153088
1         AUT  2005  20.000020  15.275962
2         AUT  2006  20.203231  15.789915
3         AUT  2007  20.379933  16.193482
4         AUT  2008  20.455821  15.865556

In [109]:
agricultura =pd.read_csv(r'Datsets\empleos_agricultura.csv')

In [110]:
agricultura.drop(['Indicator Name','Indicator Code',"1960","1961","1962","1963","1964","1965","1966","1967","1968","1969","1970","1971","1972","1973","1974","1975","1976","1977","1978","1979","1980","1981","1982","1983","1984","1985","1986","1987","1988","1989",'1990','2020','2021','Unnamed: 66'], axis=1, inplace= True)

In [111]:
agricultura = agricultura.melt(id_vars=['Country Name','Country Code'], var_name='anio', value_name='%empleo_agricultura')

In [112]:
agricultura.rename(columns={'Country Name':'pais','Country Code':'codigo_pais'}, inplace=True)

In [113]:
agricultura['anio'] = agricultura['anio'].astype('int64')

In [114]:
agricultura.head()

         pais codigo_pais  anio  %empleo_agricultura
0       Aruba         ABW  1991                  NaN
1         NaN         AFE  1991            65.712572
2  Afganistán         AFG  1991            63.430000
3         NaN         AFW  1991            59.315893
4      Angola         AGO  1991            39.830002

In [115]:
industria = pd.read_csv(r'Datsets\empleos_industria.csv')

In [116]:
industria.drop(['Indicator Name','Indicator Code',"1960","1961","1962","1963","1964","1965","1966","1967","1968","1969","1970","1971","1972","1973","1974","1975","1976","1977","1978","1979","1980","1981","1982","1983","1984","1985","1986","1987","1988","1989",'1990','2020','2021','Unnamed: 66'], axis=1, inplace= True)

In [117]:
industria = industria.melt(id_vars=['Country Name','Country Code'], var_name='anio', value_name='%empleo_industria')

In [118]:
industria.rename(columns={'Country Name':'pais','Country Code':'codigo_pais'}, inplace=True)

In [119]:
industria['anio'] = industria['anio'].astype('int64')

In [120]:
industria.head()

         pais codigo_pais  anio  %empleo_industria
0       Aruba         ABW  1991                NaN
1         NaN         AFE  1991          10.018941
2  Afganistán         AFG  1991          12.430000
3         NaN         AFW  1991          11.787986
4      Angola         AGO  1991           8.880000

In [121]:
servicio = pd.read_csv(r'Datsets\empleos_servicio.csv')

In [122]:
servicio.drop(['Indicator Name','Indicator Code',"1960","1961","1962","1963","1964","1965","1966","1967","1968","1969","1970","1971","1972","1973","1974","1975","1976","1977","1978","1979","1980","1981","1982","1983","1984","1985","1986","1987","1988","1989",'1990','2020','2021','Unnamed: 66'], axis=1, inplace= True)

In [123]:
servicio = servicio.melt(id_vars=['Country Name','Country Code'], var_name='anio', value_name='%empleo_servicio')

In [124]:
servicio.rename(columns={'Country Name':'pais','Country Code':'codigo_pais'}, inplace=True)

In [125]:
servicio['anio'] = servicio['anio'].astype('int64')

In [126]:
servicio.head()

         pais codigo_pais  anio  %empleo_servicio
0       Aruba         ABW  1991               NaN
1         NaN         AFE  1991         24.269209
2  Afganistán         AFG  1991         24.139999
3         NaN         AFW  1991         28.896146
4      Angola         AGO  1991         51.299999

In [127]:
merge1 = pd.merge(pib, df_salario_minimo, on=['codigo_pais','pais','anio'], how='outer')

In [128]:
merge2 = pd.merge(merge1, df_average_wages, on=['codigo_pais','anio'], how='outer')

In [129]:
merge3 = pd.merge(merge2, df_wage_levels_merged, on=['codigo_pais','anio'], how='outer')

In [130]:
merge4 =pd.merge(merge3, agricultura, on=['codigo_pais','pais','anio'], how='outer')

In [131]:
merge5 = pd.merge(merge4, industria, on=['codigo_pais','pais','anio'], how='outer')

In [132]:
fact_ind_economico = pd.merge(merge5, servicio, on=['codigo_pais','pais','anio'], how='outer')

In [133]:
fact_ind_economico

,pais,codigo_pais,anio,PIB,salario_minimo,salario_promedio,high_pay,low_pay,%empleo_agricultura,%empleo_industria,%empleo_servicio
0,Aruba,ABW,1990,2.195805,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Afganistán,AFG,1990,0.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Angola,AGO,1990,-6.626409,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Albania,ALB,1990,-11.187905,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Andorra,AND,1990,0.042321,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
8853,NaN,AFW,2017,NaN,NaN,NaN,NaN,NaN,42.795047,13.010098,44.195562
8854,NaN,AFE,2018,NaN,NaN,NaN,NaN,NaN,59.614906,9.500147,30.884068
8855,NaN,AFW,2018,NaN,NaN,NaN,NaN,NaN,42.165922,12.970608,44.867739
8856,NaN,AFE,2019,NaN,NaN,NaN,NaN,NaN,59.307385,9.422173,31.270661
8857,NaN,AFW,2019,NaN,NaN,NaN,NaN,NaN,41.541598,12.994038,45.465808